<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">

  
  <title>Retroalimentacii&oacute;n Propuesta</title>
</head>


<body>

<h1>Retroalimentaci&oacute;n Propuesta</h1>

<br>

<br>

<span style="font-weight: bold;">Oscar Miguel Alonso Moreno<br>
</span><span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;No public&oacute;<br>
<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>El segundo objetivo espec&iacute;fico deber&iacute;a precisar
que hace diferente el modelo planteado (tal vez, "modelo computacional
de red inmune basado en coevoluci&oacute;n"?<br>
La metodolog&iacute;a deber&iacute;a ser m&aacute;s precisa sobre la
validaci&oacute;n del modelo, espec&iacute;ficamente el tipo de
problemas a resolver. <br>

&nbsp;<br>

<span style="font-weight: bold;">Edwin Andr&eacute;s Bernal Lopez</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;Considere reducir los antecedentes en IA y diagn&oacute;stico, haga m&aacute;s &eacute;nfasis en trabajos recientes<br>

&nbsp;En los antecedentes no dice absolutamente nada sobre el&nbsp;
proceso de adaptaci&oacute;n neonatal! deber&iacute;a ser m&aacute;s
enf&aacute;tico en la importancia de apoyar este proceso. <br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:<br>
</span>El objetivo general debe ser m&aacute;s suscinto.<br>
Los objetivos espec&iacute;ficos no son suficientemente claros y se
dejan cosas importantes por fuera como la validaci&oacute;n del sistema.<br>
La relevancia del proyecto debe establecerse antes de presentar la propuesta.<br>
La metodolog&iacute;a debe ser m&aacute;s clara y detallada.<br>
<span style="text-decoration: underline;"></span><span style="font-weight: bold;"></span><br>

<span style="font-weight: bold;">Victor Andres Bucheli Guerrero</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;No public&oacute;<br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>No tiene objetivos, metodolog&iacute;a ni actividades.<br>
<br>

<span style="font-weight: bold;">Jose Ricardo Bustos Molina</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;Publique el pdf no el doc!<br>

&nbsp;Los antecedentes son muy pobres. Debe hablar m&aacute;s sobre
este tipo de simulaciones y sobre todo hablar m&aacute;s sobre control
ambiental: cu&aacute;l es su objetivo? c&oacute;mo se realiza
tradicionalmente? <br>

&nbsp;Igualmente, la justificaci&oacute;n es d&eacute;bil. No me parece
claro que el desarrollo de ambientes virtuales es la &uacute;nica
alternativa para subsanar la falta de laboratorios.<br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>Dada la complejidad del problema a abordar, sugiero la
posibilidad de concentrarse en el modelamiento del ambiente virtual
omitiendo la validaci&oacute;n del sistema de control. Es importante
conseguir la asesoria de un experto en el &aacute;rea particular de
aplicaci&oacute;n (por ej. un zootecnista). La definici&oacute;n del
problema, los objetivos y la metodolog&iacute;a debeb cambiarse
acordemente. Es importante enfatizar el problema computacional a
resolver y como se va a validar la soluci&oacute;n obtenida. La
metodolog&iacute;a debe ser m&aacute;s clara y la secuencia de
actividades m&aacute;s detallada.<br>
<br>
<br>

<span style="font-weight: bold;">Juan Carlos Caicedo Rueda</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;el &uacute;ltimo p&aacute;rrafo de la def. del problema est&aacute; desligado del resto. Mejore la redacci&oacute;n.<br>

<span style="font-weight: bold;">&nbsp;</span><span style="text-decoration: underline;">Segunda entrega:<br>
</span>De m&aacute;s detalles en la definici&oacute;n del problema
sobre los subproblemas computacionales que el problema general reviste
(definici&oacute;n de una medida objetiva de similaridad, indice
eficiente, etc).<br>
A qu&eacute; se refiere con contenido visual?<br>
Cambie la redacci&oacute;n de los obj. espec&iacute;ficos para precisar
claramente que va a producir. Por ej., el 4to objetivo deber&iacute;a
decir algo como "proponer un mecanismo de indexamiento...."<br>
<span style="text-decoration: underline;"></span><span style="font-weight: bold;"></span><br style="font-weight: bold;">

<span style="font-weight: bold;">Juan David Cruz Gomez</span><br style="font-weight: bold;">
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;La gesti&oacute;n del conocimiento es apenas uno de los elementos
en el problema que desea resolver. Debe ser m&aacute;s breve en su
descripci&oacute;n (un par de p&aacute;rrafos). En los antecedentes se
debe abordar la extracci&oacute;n de conocimiento en correos
electr&oacute;nicos (usted tiene todo un estado del arte sobre el
tema!). La definici&oacute;n del problema debe ser muy precisa, no
m&aacute;s de 2/3 p&aacute;rrafos. Mucho del texto en la def. del
problema lo puede pasar a antecedentes y justificaci&oacute;n.<br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>Pienso que la def. del problema se puede concretar un poco m&aacute;s. <br>
El objetivo general deber&iacute;a decir algo como "Desarrollar un sistema para la extracci&oacute;n de conocimiento...."<br>
Cambie la redacci&oacute;n de los obj. espec&iacute;ficos para precisar claramente
que va a producir. Por ej., elprimer objetivo deber&iacute;a decir algo como
"proponer/desarrollar un esquema de representaci&oacute;n...."<br>
No tuvo en cuenta la validaci&oacute;n del sistema en los objs. espec&iacute;ficos y la metodolog&iacute;a.<br>

<span style="font-weight: bold;"></span>&nbsp;<br>

<span style="font-weight: bold;">Ricardo Enrique Gutierrez Carvajal</span><br>
<span style="text-decoration: underline;">Primera entrega:<br>
</span>&nbsp;&nbsp;Redacci&oacute;n y ortograf&iacute;a muy deficiente. <br>
<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>La palabra librer&iacute;a en el obj general se muy restrictiva. Considere usar modelo o sistema.<br>
Los objetivos espec&iacute;ficos sugieren simplemente la
adaptaci&oacute;n de un programa existente a una tarea muy concreta.
Debe enfatizarse el hecho que se va aproponer un modelo de
navegaci&oacute;n. Debe omitirse el &uacute;ltimo obj.
espec&iacute;fico y adicionarse uno que se refiera a la
validaci&oacute;n del sistema propuesto.<br>
La metodolog&iacute;a debe ser m&aacute;s detallada y debe aclararse como se validar&aacute; el modelo propuesto.<br>
La secuencia de actividades debe ser m&aacute; detallada.<br>
<br>

<span style="font-weight: bold;">Mario Linares Vasquez</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><br>
&nbsp;&nbsp;La definici&oacute;n del problema debe hacerse en un lenguaje impersonal. <br>

&nbsp;Se debe hacer &eacute;nfasis en definir el problema en si y no
plantear las alternativas de soluci&oacute;n. Explorar las alternativas
de soluci&oacute;n, por ejemplo la t&eacute;cnica de clustering, es
parte del desarrollo del proyecto <br>

&nbsp;Enfatizar el problema computacional que plantean la
generaci&oacute;n de creencias y el diese&ntilde;o del portafolio
autom&aacute;ticamente.<br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>Considere cambiar "proceso completo (2 fases) de
selecci&oacute;n&nbsp; de portafolio" por "proceso&nbsp; de
selecci&oacute;n&nbsp; de portafolio". <br>
En el segundo obj espec&iacute;fico no es claro el prop&oacute;sito del modelo a construir. <br>
La metodolog&iacute;a est&aacute; muy orientada al desarrollo de
software y no se aclara como se construir&aacute;n los modelos
propuestos. <br>

<span style="font-weight: bold;">Luis Fernando Medina Cardona</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><br>
&nbsp;&nbsp;Mejorar la forma. El texto debe estar estructurado en p&aacute;rrafos.<br>

&nbsp;<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>El dise&ntilde;o de un lenguaje es algo muy espec&iacute;fico,
considere el desarrollo de una metodolog&iacute;a de especificaci;on de
requerimientos como alternativa. En tal caso modifique la
definici&oacute;n del problema, los objetivos y la metodolog&iacute;a
acordemente. La secuencia de actividades debe ser m&aacute;s detallada.<br>
<br>

<span style="font-weight: bold;">Eduardo Javier Ortega Urrego</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><br>
&nbsp;&nbsp;Los antecedentes y justificaci&oacute;n est&aacute;n muy extensos
y son dif&iacute;ciles de leer para alguien no experto. Debe iniciar
introduciendo el tema de una manera amplia y revisar el trabajo previo
de un manera general sin entrar en detalles y de una forma no tan
esquem&aacute;tica. La definici&oacute;n del problema debe ser muy
precisa, no m&aacute;s de 2/3 p&aacute;rrafos. Mucho del texto en la
def. del problema lo puede pasar a antecedentes y justificaci&oacute;n.<br>
<span style="text-decoration: underline;">Segunda entrega:<br>
</span><span style="font-weight: bold;"></span>El tercer obj espec&iacute;fico es muy ambicioso. Es suficiente decir que se va a plantear una alternativa.<br>
Debe incluirse un obj espec&iacute;fico que aborde la validaci&oacute;n del algoritmo propuesto.<br>
La metodolog&iacute;a debe ser m&aacute;s clara y detallada (software
de simulaci&oacute;n a usar, validaci&oacute;n, dise&ntilde;o
experimental, etc).<br>
Debe incluir una lista detallada de actividades.<br>

&nbsp;<br>

<span style="font-weight: bold;">Roberto Pava</span><br>
<span style="text-decoration: underline;">Primera entrega:<br>
</span>&nbsp;&nbsp;Los antecedentes son muy densos y la motivaci&oacute;n y
justificaci&oacute;n del problema no est&aacute;n claras. Es importante
enfatizar los aspectos computacionales, la bioinform&aacute;tica. Se
debe empezar de manera general e ir precisando hasta llegar al problema.<br>

&nbsp;La def. del problema es muy vaga. No es claro cual es el problema
computacional que quiere resolver, debe enfatizar esta m&aacute;s que
el problema biol&oacute;gico. <br>
<span style="text-decoration: underline;">Segunda entrega:<br>
</span>El objetivo general debe referirse ala detecci&oacute;n de
cadenas repetidas en secuencias sin limitarse a ciertos tipos de seres
vivos.<span style="text-decoration: underline;"><br>
</span><span style="font-weight: bold;"></span>Los objetivos
espec&iacute;ficos, as&iacute; como la metodolog&iacute;a, deben
concentrarse en el problema computacional, la construcci&oacute;n del
algoritmo que lo resuelve, su an&aacute;lisis, validaci&oacute;n y
comparaci&oacute;n con otros algoritmos.<br>
La metodolog&iacute;a debe ser m&aacute;s detallada.<br>
&nbsp;<br>
<br>

<span style="font-weight: bold;">Javier Eduardo Rojas Romero</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;Es importante que los antecedentes no se limiten al problema
biom&eacute;dico. Se debe enfatizar el problema computacional y
motivarlo. Sugiero mover la secci&oacute;n 5.1 a los
antecedentes.&nbsp; La definici&oacute;n del problema debe ser muy
precisa y concisa, no m&aacute;s de 2/3 p&aacute;rrafos. La
secci&oacute;n 5.2 puede funcionar es incompleta.<br>
<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>La secci&oacute;n 5.1 puede ser eliminada. La definici&oacute;n
del problema est&aacute; bien, pero falta precisar el problema
computacional que implicar tener un sistema de diagn&oacute;stico
completamente automatizado (segmentaci&oacute;n, identificaci&oacute;n
de c&eacute;lulas, c&aacute;lculo de &aacute;reas, etc).<br>
El objetivo general podr&iacute;a quedar mejor como "desarrollar un
sistema autom&aacute;tico de medici&oacute;n....". Los &iacute;tems en
el objetivo 3 son demasiado espec&iacute;ficos, considere eliminarlos.<br>
La metodolog&iacute;a es muy completa y detallada, solo falta un mejor p&aacute;rrafo introductorio.<br>
<br>
<br>

<span style="font-weight: bold;">Andrea Del Pilar Rueda Olarte</span><br>

<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>&nbsp;Algunas partes de la definici&oacute;n del problema se pueden
pasar a antecedentes y justificaci&oacute;n. La definici&oacute;n del
problema debe ser muy precisa, sugiero usar un lenguaje m&aacute;s
directo.<br>
<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>Aclarar objetivo espec&iacute;fico 2.<br>
La secci&oacute;n de metodolog&iacute;a requiere de un p&aacute;rrafo introductorio antes de la enumeraci&oacute;n.<br>
Faltan m&aacute;s detalles en la metodolog&iacute;a sobre todo en el
punto 2. Recuerde que la idea es decir c&oacute;mo lo va a hacer. <br>
Por qu&eacute; solo validaci&oacute;n con figuras 2D?<br>
<br>

<span style="font-weight: bold;">Pedro Alexander Salamanca Rivera</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
Los antecedentes deben cubrir de manera amplia el trabajo previo en el
&aacute;rea y se debe ser m&aacute;s enf&aacute;tico en la
justificaci&oacute;n. La identificaci&oacute;n del problema es un poco
vaga, debe precisarse cu&aacute;l es el problema computacional a
resolver.<br>

<span style="text-decoration: underline;">Segunda entrega:<br>
</span>En la definici&oacute;n del problema, precise el problema computacional que implica hacer un sistema recomendador personal.<span style="text-decoration: underline;"><br>
</span><span style="font-weight: bold;"></span>Elimine la palabra novedoso del objetivo general. <br>
Los objetivos espec&iacute;ficos deben ser m&aacute;s claros y
considere condensar algunos de ellos para dejar m&aacute;ximo 4/5
objetivos.<br>
Debe ser m&aacute;s claro y detallado en la metodolog&iacute;a. <br>
<br>

<span style="font-weight: bold;">Jhon Alexis Sanabria Garzon</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;La propuesta debe estar escrita en un lenguaje muy preciso y
conciso. Los antecedentes son innecesariamente largos. Debe iniciar con
una perspectiva amplia, pero debe ir al grano, es decir al uso de
herramientas KDD y DM en plataformas virtuales. <br>

&nbsp;Las referencias son pr&aacute;cticamente nulas, toda
aseveraci&oacute;n debe estar soportada. Las gr&aacute;ficas y tablas
deben tener un leyenda clara y deben ser referenciadas y explicadas en
el texto.<br>

&nbsp;La definici&oacute;n del problema es muy vaga. Debe ser muy
precisa y concisa, no m&aacute;s de 2/3 p&aacute;rrafos. Debe
especificarse de manera precisa cu&aacute;l es el problema
computacional a resolver.<br>

<span style="text-decoration: underline;">Segunda entrega:</span><span style="font-weight: bold;"><br>
</span>La identificaci&oacute;n del problema sigue siendo vaga. Debe
ser muy preciso al especificar el problema COMPUTACIONAL que va a
resolver: identificaci&oacute;n autom&aacute;tica de los perfiles de
usuario.<br>
Pienso que debe concentrarse en&nbsp;la personalizaci&oacute;n y dejar de un lado la estructura.<br>
El objetivo general debe ser m&aacute;s preciso y suscinto. Los
objetivos espec&iacute;ficos, al igual que la metodolog&iacute;a,
indican que va a abordar el problema como un t&iacute;pico problema de
miner&iacute;a de datos y no pienso que sea el caso; es importantes que
lo enfoque como un problema de personalizaci&oacute;n. <br>
La lista de actividades es muy suscinta.<br>
<br>
<br>

<span style="font-weight: bold;">Carmen Constanza Uribe Sandoval</span><br>
<span style="text-decoration: underline;">Primera entrega:</span><span style="font-weight: bold;"><br>
</span>
&nbsp;Los antecedentes no son claros. Debe elaborar m&aacute;s de
manera que el problema sea entendible a alguien no experto en el tema.
Una gr&aacute;fica puede ayudar bastante. <br>

&nbsp;La justificaci&oacute;n es muy d&eacute;bil. Debe usar un lenguaje m&aacute;s enf&aacute;tico y dar cifras concretas. <br>

&nbsp;La identificaci&oacute;n del problema es muy vaga. No se precisa
que restricci&oacute;n debe haber en la conexi&oacute;n de los
amplificadores. use lenguaje matem&aacute;tico para establecer el
problema de manera formal y precisa.<br>
<span style="text-decoration: underline;">Segunda entrega: </span><br>
Mejore la redacci&oacute;n de la justificaci&oacute;n y h&aacute;gala m&aacute;s contundente.<br>
Qu&eacute; hace a este problema dif&iacute;cil de resolver por m&eacute;todos convencionales?<br>
Cu&aacute;l es el problema de las soluciones previas (ej. Delmas [4])?<br>
Por qu&eacute; vale la pena usar AGs?<br>
Sea m&aacute;s formal en la definici&oacute;n del problema.<br>
Haga m&aacute;s sucinto el objetivo general.<br>
Los objetivos espec&iacute;ficos son muy puntuales y se dejan elementos
importantes por fuera como la experimentaci&oacute;n y la
validaci&oacute;n del modelo.<br>
La metodolog&iacute;a es muy debil y suscinta.<br>
No hay secuencia de actividades.<br>
<br>
<span style="text-decoration: underline;"></span><span style="font-weight: bold;"><br>
<br>
</span>
</body>
</html>
